# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2022-06-14 18:18:00 krylon>
#
#+TAGS: go(g) internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p)
#+PRIORITIES: A G D

Raconteur is an application to play audio books or podcasts.
My main goal, though, is to learn about GUI programming (which have done
before but suck at), specifically Gtk3 (I have prior experience using Gtk2
from C, Python, Perl, and Ruby), and its Go bindings.
Also, this might be a good opportunity to learn about dbus, but I am not sure
yet how that would factor in.

* Clock
  Here I keep track of the time I waste on this futile effort.
  #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
  #+CAPTION: Clock summary at [2022-06-14 Di 18:17]
  | Headline                   | Time      |            |      |      |
  |----------------------------+-----------+------------+------+------|
  | *Total time*               | *2d 3:36* |            |      |      |
  |----------------------------+-----------+------------+------+------|
  | *Moving parts*             | *2d 3:36* |            |      |      |
  | \_  /Data types/           |           | /2:40/     |      |      |
  | \_  /Database/             |           | /7:25/     |      |      |
  | \_  /Scanner/              |           | /2:22/     |      |      |
  | \_    Metadata             |           |            | 0:32 |      |
  | \_  /GUI/                  |           | /1d 15:09/ |      |      |
  | \_    TreeView             |           |            | 9:09 |      |
  | \_      Multiple Selection |           |            |      | 7:33 |
  | \_      Sorting            |           |            |      | 1:36 |
  #+END:

* Moving parts
** Data types
   :LOGBOOK:
   CLOCK: [2021-09-06 Mo 20:34]--[2021-09-06 Mo 23:14] =>  2:40
   :END:
   I will need types to describe what I am dealing with.
** Database
   :LOGBOOK:
   CLOCK: [2022-06-07 Di 20:20]--[2022-06-07 Di 21:14] =>  0:54
   CLOCK: [2021-09-11 Sa 22:27]--[2021-09-12 So 00:06] =>  1:39
   CLOCK: [2021-09-11 Sa 19:50]--[2021-09-11 Sa 20:49] =>  0:59
   CLOCK: [2021-09-11 Sa 15:50]--[2021-09-11 Sa 17:56] =>  2:06
   CLOCK: [2021-09-07 Di 18:45]--[2021-09-07 Di 20:32] =>  1:47
   :END:
   I am going to use SQLite, because for our use case, it is awesome.
   Plus, I like SQL.
** Scanner
   :LOGBOOK:
   CLOCK: [2021-09-07 Di 20:36]--[2021-09-07 Di 22:26] =>  1:50
   :END:
   Scanner walks directory trees looking for audio files. Roughly speaking.
*** TODO Metadata
    :LOGBOOK:
    CLOCK: [2022-06-14 Di 17:45]--[2022-06-14 Di 18:17] =>  0:32
    :END:
    I want to read and use metadata to automatically assign Files to Programs
    and to automatically set the title.
** GUI
   :LOGBOOK:
   CLOCK: [2022-06-11 Sa 16:35]--[2022-06-11 Sa 17:57] =>  1:22
   CLOCK: [2022-06-10 Fr 16:33]--[2022-06-10 Fr 22:05] =>  5:32
   CLOCK: [2022-06-10 Fr 15:10]--[2022-06-10 Fr 16:10] =>  1:00
   CLOCK: [2022-06-09 Do 20:04]--[2022-06-09 Do 23:44] =>  3:40
   CLOCK: [2022-06-09 Do 17:23]--[2022-06-09 Do 19:48] =>  2:25
   CLOCK: [2022-06-09 Do 13:30]--[2022-06-09 Do 13:44] =>  0:14
   CLOCK: [2022-06-08 Mi 15:56]--[2022-06-08 Mi 21:33] =>  5:37
   CLOCK: [2022-06-07 Di 21:14]--[2022-06-07 Di 22:14] =>  1:00
   CLOCK: [2022-06-07 Di 17:50]--[2022-06-07 Di 19:37] =>  1:47
   CLOCK: [2022-06-05 So 16:32]--[2022-06-05 So 17:10] =>  0:38
   CLOCK: [2022-06-04 Sa 17:59]--[2022-06-04 Sa 22:51] =>  4:52
   CLOCK: [2022-06-03 Fr 18:04]--[2022-06-03 Fr 19:57] =>  1:53
   :END:
   Like I said, we're going to use gotk3, the Go bindings to Gtk3. I think
   Gtk4 is a thing, but ... whatever, I'm still slightly annoyed I cannot just
   use Gtk2, although the changes seem to not be that drastic.
*** TreeView
**** TODO Multiple Selection
     :LOGBOOK:
     CLOCK: [2022-06-13 Mo 17:09]--[2022-06-13 Mo 21:27] =>  4:18
     CLOCK: [2022-06-11 Sa 19:35]--[2022-06-11 Sa 22:50] =>  3:15
     :END:
**** TODO Sorting
     :LOGBOOK:
     CLOCK: [2022-06-11 Sa 17:59]--[2022-06-11 Sa 19:35] =>  1:36
     :END:
     Maybe another day?
* Questions
* Bugs
